---
kind: method
id: M:Autodesk.Revit.DB.Analysis.ValueAtPoint.#ctor(Autodesk.Revit.DB.Analysis.ValueAtPoint)
source: html/cf2172ca-1360-342b-bb6e-8d60c3be7b64.htm
---
# Autodesk.Revit.DB.Analysis.ValueAtPoint.#ctor Method

Creates a copy of the given ValueAtPoint instance.

## Syntax (C#)
```csharp
public ValueAtPoint(
	ValueAtPoint otherObject
)
```

## Parameters
- **otherObject** (`Autodesk.Revit.DB.Analysis.ValueAtPoint`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null